src/main/resources/xml/mtn-notify-ussd-abort.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <ns1:NotifySOAPHeader xmlns:ns1="http://www.huawei.com.cn/schema/common/v2_1">
            <ns1:spRevId>35000001</ns1:spRevId>
            <ns1:spRevpassword>206D88BB7F3D154B130DD6E1E0B8828B</ns1:spRevpassword>
            <ns1:spId>000201</ns1:spId>
            <ns1:serviceId>35000001000029</ns1:serviceId>
            <ns1:timeStamp>20100731064245</ns1:timeStamp>
            <ns1:traceUniqueID>404092403801104031047140004003</ns1:traceUniqueID>
        </ns1:NotifySOAPHeader>
    </soapenv:Header>
    <soapenv:Body>
        <ns2:notifyUssdAbort xmlns:ns2="http://www.csapi.org/schema/parlayx/ussd/notification/v1_0/local">
            <ns2:senderCB>320207133</ns2:senderCB>
            <ns2:receiveCB>220207133</ns2:receiveCB>
            <ns2:abortReason>The end user cancels.</ns2:abortReason>
            <ns2:extensionInfo>
                <item>
                    <key></key>
                    <value></value>
                </item>
            </ns2:extensionInfo>
        </ns2:notifyUssdAbort>
    </soapenv:Body>
</soapenv:Envelope>
